clc; clear; close all;

% % 示例问题1
% c = [2; 3]; % 目标函数系数
% A = [1 2; 4 0; 0 4]; % 约束条件系数矩阵
% b = [8; 16; 12]; % 约束条件右侧常数向量
% m = 3;
% A = [A, eye(3)];
% c = [c;zeros(3,1)];

% 示例问题2
% c = [3; 5]; % 目标函数系数
% A = [1 2; 2 1]; % 约束条件系数矩阵
% b = [8; 10]; % 约束条件右侧常数向量
% m = 2; 
% A = [A, eye(m)];
% c = [c;zeros(m,1)];

% 示例问题3
% c = [6; 8]; % 目标函数系数
% A = [3 2; 1 3; 2 1]; % 约束条件系数矩阵
% b = [18; 15; 10]; % 约束条件右侧常数向量
% m = 3; 
% A = [A, eye(m)];
% c = [c;zeros(m,1)];

% 示例问题4
% c = [10; 8; 6]; % 目标函数系数
% A = [8 4 5; 6 5 3; 2 3 4; 1 0 -.5]; % 约束条件系数矩阵
% b = [40; 30; 20; 0]; % 约束条件右侧常数向量
% m = 4;  
% A = [A, eye(m)];
% c = [c;zeros(m,1)];

% 示例问题5 (大M法）
c = [2; 3; -5]; % 目标函数系数
A = [1 1 1; 2 -5 1]; % 约束条件系数矩阵
b = [7; 10]; % 约束条件右侧常数向量
m = 2;
M = 1000;
A = [A, [0;-1]];
A = [A, eye(m)]; 
c = [c;zeros(m+1,1)];
c(end-1) = -M;
c(end) = -M;

% % 示例问题6 (大M法）
% c = [2; 3]; % 目标函数系数
% A = [1 1; 4 0; 0 4]; % 约束条件系数矩阵
% b = [8; 16; 12]; % 约束条件右侧常数向量
% m = 3;
% M = 1000;
% A = [A, eye(m)];
% A = [A(:,1:end-2), [0;-1;0],A(:,end-1:end)];
% c = [c;zeros(m+1,1)];
% c(end-1) = -M;
% c(end) = -M;

% % 示例问题7 (死循环）
% c = [0; 0; 0; 3/4; -20; 1/2; -6]; % 目标函数系数
% A = [1 0 0 1/4 -8 -1 9;
%      0 1 0 1/2 -12 -1/2 3;
%      0 0 1 0 0 1 0]; % 约束条件系数矩阵
% b = [0; 0; 1]; % 约束条件右侧常数向量


% % 示例问题8 (多余性）
% c = [1; 2]; % 目标函数系数
% A = [-2 1; 1 1; -1 1; 1 0;]; % 约束条件系数矩阵
% b = [4; 3; 2; 2]; % 约束条件右侧常数向量
% m = 4;  
% A = [A, eye(m)];
% c = [c;zeros(m,1)];

% % 示例问题9 (多余性）
% c = -[-3; 2; -1]; % 目标函数系数
% A = [1 -1 1; 1 1 -3; 2 0 -2; 0 0 1]; % 约束条件系数矩阵
% b = [4; 2; 6; 2]; % 约束条件右侧常数向量
% m = 4;  
% M = 1000;
% A = [A, eye(m)];
% c = [c;zeros(m,1)];
% c(4:6) = -M;






[sol,z] = simplex_method(A,b,c);

disp('════════════ 最优解 ════════════');
disp(sol');
disp('════════════ 最优值 ════════════');
disp(z);

% [EOF]
